Repository: PikeDeveloper/convi
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr, hi, it, ja, pt, ru, zh

# speedBodyIsFaling
source: As we can see the body is falling, we calculate its speed like a free fall where initial V is zero and for the time we subtract the time it took for it to rise at the maximunn height
de: Da wir sehen können, dass der Körper fällt, berechnen wir seine Geschwindigkeit wie bei einem freien Fall, wobei das anfängliche V null ist, und subtrahieren von der Zeit, die es dauerte, bis er auf die maximale Höhe aufstieg
es: Como podemos ver el cuerpo está cayendo, calculamos su velocidad como una caída libre donde V inicial es cero y por el tiempo le restamos el tiempo que tardó en subir a la altura máxima
fr: Comme nous pouvons voir que le corps tombe, nous calculons sa vitesse comme une chute libre où V initial est égal à zéro et pour le temps nous soustrayons le temps qu'il a fallu pour qu'il s'élève à la hauteur maximale
hi: जैसा कि हम देख सकते हैं कि पिंड गिर रहा है, इसलिए हम इसकी गति की गणना एक फ्री फॉल की तरह करते हैं जहां प्रारंभिक V शून्य है और हम उस समय को घटाते हैं जो इसे अधिकतम ऊंचाई पर उठने में लगा है।
it: Come possiamo vedere il corpo sta cadendo, calcoliamo la sua velocità come una caduta libera dove V iniziale è zero e per il tempo sottraiamo il tempo impiegato per farlo salire all'altezza massima
ja: 物体が落下していることがわかるので、自由落下のように速度を計算します。 ここで、初期Vはゼロであり、その時間については、最大の高さで上昇するのにかかった時間を 減算します。
pt: Como podemos ver que o corpo está caindo, calculamos sua velocidade como uma queda livre onde V inicial é zero e pelo tempo subtraímos o tempo que levou para ele subir na altura máxima
ru: мы видим, что тело падает, мы вычисляем его скорость как свободное падение , где начальное V равно нулю, и из времени мы вычитаем время, которое потребовалось ему, чтобы оно поднялось на максимальную высоту
zh: 正如我们可以看到身体正在下落，我们计算它的速度就像一个自由落体 其中初始 V 为零并且我们减去它 在最大高度上升所花费的时间

# explanationNote0
source: When a body is thrown upwards, after reaching a certain height it begins to fall, to determine its vertical speed in an instant of time it is necessary to know if at that instant it is going up (Tsubida) or down, the total time in the air known as flight time (Tv)
de: Wenn ein Körper nach oben geschleudert wird, nachdem er eine bestimmte Höhe erreicht hat, beginnt er zu fallen, um seine vertikale Geschwindigkeit in einem Augenblick zu bestimmen, ist es notwendig zu wissen, ob er in diesem Augenblick nach oben (Tsubida) oder nach unten geht , die Gesamtzeit in der Luft, bekannt als Flugzeit (Tv)
es: Cuando un cuerpo es lanzado hacia arriba, luego de alcanzar cierta altura comienza a caer, para determinar su velocidad vertical en un instante de tiempo es necesario saber si en ese instante está subiendo (Tsubida) o bajando, nel tiempo total en el aire conocido como tiempo de vuelo (Tv)
fr: Lorsqu'un corps est projeté vers le haut, après avoir atteint a une certaine hauteur il commence à tomber, pour déterminer sa vitesse verticale en un instant il faut savoir si à cet instant il monte (Tsubida) ou descend , le temps total dans les airs appelé temps de vol (Tv)
hi: जब किसी पिंड को ऊपर की ओर फेंका जाता है, तो एक निश्चित ऊंचाई तक पहुंचने के बाद वह गिरना शुरू हो जाता है, यह निर्धारित करने के लिए कि उसकी ऊर्ध्वाधर गति एक पल में निर्धारित की जाती है, यह जानना आवश्यक है कि क्या उस पल में यह ऊपर (त्सुबिदा) जा रहा है या नीचे , हवा में कुल समय उड़ान समय (टीवी) के रूप में जाना जाता है
it: Quando un corpo viene lanciato verso l'alto, dopo aver raggiunto a una certa altezza inizia a cadere, per determinare la sua velocità verticale in un istante di tempo è necessario sapere se in quell'istante sta salendo (Tsubida) o scendendo , il tempo totale in aria noto come tempo di volo (Tv)
ja: 物体が上向きに投げられると、 一定の高さに達した後、落下し始めます。 ある瞬間の垂直速度を決定するには、 その瞬間に上昇しているのか（ツビダ）、下降しているのかを知る必要があります。 、 飛行時間（Tv）として知られる空中の合計時間
pt: Quando um corpo é lançado para cima, após atingir uma certa altura ele começa a cair, para determinar sua velocidade vertical em um instante de tempo é necessário saber se nesse instante ele está subindo (Tsubida) ou descendo, o tempo total no ar conhecido como tempo de voo (Tv)
ru: Когда тело брошено вверх, после достижения определенной высоты оно начинает падать, для определения его вертикальной скорости в момент времени необходимо знать, движется ли оно в этот момент вверх (Цубида) или вниз , общее время в воздухе, известное как время полета (Tv)
zh: 当一个物体被向上抛出时，在达到一定高度后它开始下落，为了确定它在某一瞬间的垂直速度，有必要 知道它是在那个瞬间上升（Tsubida）还是下降, 在空中的总时间称为飞行时间 (Tv)

# vyOnTheFloor
source: Vy is zero because it is already on the floor
de: Vy ist Null, weil es bereits auf dem Boden liegt
es: Vy es cero porque ya está en el piso
fr: Vy est nul car il est déjà au sol
hi: Vy शून्य है क्योंकि यह पहले से ही फर्श पर है
it: Vy è zero perché è già sul pavimento
ja: Vyはすでに床にあるため、ゼロです
pt: Vy é zero porque já está no chão
ru: Vy равен нулю, потому что он уже на полу
zh: Vy 为零，因为它已经在地板上了

# timeToGoUpSameTimeToGoDown
source: The time it takes to reach its maximum height is the same time it takes to descend to the ground, the time it is in the air is known as the flight time (Tv) and for this exercise it is equal to
de: Die Zeit, die benötigt wird, um seine maximale Höhe zu erreichen, entspricht der Zeit, die er benötigt, um auf den Boden abzusinken, die Zeit in der Luft wird als Flugzeit (Tv) bezeichnet und ist für diese Übung gleich zu
es: El tiempo que tarda en alcanzar su altura máxima es el mismo tiempo que tarda en descender al suelo, el tiempo que está en el aire se conoce como tiempo de vuelo (Tv) y para este ejercicio es igual a:
fr: Le temps qu'il faut pour atteindre sa hauteur maximale est le même temps qu'il faut pour descendre au sol, le temps qu'il est dans l'air est connu comme le temps de vol (Tv) et pour cet exercice il est égal à
hi: अपनी अधिकतम ऊंचाई तक पहुंचने में जितना समय लगता है उतना ही समय जमीन पर उतरने में लगता है, जिस समय में यह होता है हवा को उड़ान समय (टीवी) के रूप में जाना जाता है और इस अभ्यास के लिए यह बराबर होता है प्रति
it: Il tempo impiegato per raggiungere la sua altezza massima è lo stesso tempo impiegato per scendere a terra, il tempo trascorso in aria è noto come tempo di volo (Tv) e per questo esercizio è uguale a:
ja: 最大の高さに達するのにかかる時間は、 地面に降りるのと同じ時間であり、 空中にある時間は飛行時間（Tv）として知られています。
pt: O tempo que leva para atingir sua altura máxima é o mesmo tempo que leva para descer até o solo, o tempo que ele está no o ar é conhecido como o tempo de voo (Tv) e para este exercício it é igual a
ru: Время, необходимое для достижения максимальной высоты, равно тому же времени, которое требуется, чтобы спуститься на землю, время, в течение которого оно находится в воздухе, известно как время полета (Tv), и для этого упражнения оно равно к:
zh: 到达其最大高度所需的时间与下降到地面所需的时间 相同，它在空气中的时间 称为飞行时间 (Tv)，对于本练习， 它等于到

source: Going up
de: Aufsteigen
es: Subiendo
fr: Monter
hi: ऊपर जा रहा है
it: Salendo
ja: 上がっていく
pt: Subindo
ru: Подниматься
zh: 上

source: Going down
de: Untergehen
es: Bajando
fr: Descente
hi: नीचे जाना
it: Scendendo
ja: 下っていく
pt: Descendo
ru: Спускаться
zh: 下降

# noSolutionNegativeSquare
source: This exercise has no solution, there is no square root of a negative number
de: Diese Übung hat keine Lösung, es gibt keine Quadratwurzel aus einer negativen Zahl
es: Este ejercicio no tiene solución, no hay raíz cuadrada de un número negativo
fr: Cet exercice n'a pas de solution, il n'y a pas de racine carrée d'un nombre négatif
hi: इस अभ्यास का कोई हल नहीं है, ऋणात्मक संख्या का कोई वर्गमूल नहीं है
it: Questo esercizio non ha soluzione, non esiste una radice quadrata di un numero negativo
ja: この演習には解決策がなく、負の数の平方根はありません
pt: Este exercício não tem solução, não existe raiz quadrada de um número negativo
ru: У этого упражнения нет решения, нет квадратного корня из отрицательного числа
zh: 这个练习没有解，没有负数的平方根

source: Time
de: Zeit
es: Timepo
fr: Temps
hi: समय
it: Tempo
ja: 時間
pt: Tempo
ru: Время
zh: 时间

source: Distance
de: Distanz
es: Distancia
hi: दूरी
it: Distanza
ja: 距離
pt: Distância
ru: Расстояние
zh: 距离

source: Acceleration
de: Beschleunigung
es: Aceleración
fr: Accélération
hi: त्वरण
it: Accelerazione
ja: 加速度
pt: Aceleração
ru: Ускорение
zh: 加速

source: Initial Speed
de: Anfangsgeschwindigkeit
es: Velocidad inicial
fr: Vitesse initiale
hi: प्रारंभिक गति
it: Velocità iniziale
ja: 初期速度
pt: IVelocidade inicial
ru: Начальная скорость
zh: 初速度

source: Final Speed
de: Endgeschwindigkeit
es: Velocidad final
fr: Vitesse finale
hi: अंतिम गति
it: Velocità finale
ja: 最終速度
pt: Velocidade final
ru: Конечная скорость
zh: 最终速度

source: Speed
de: Geschwindigkeit
es: Velocidad
fr: Vitesse
hi: स्पीड
it: Velocità
ja: スピード
pt: Velocidade
ru: Скорость
zh: 速度

# negativeTimeExplanation
source: The symbol “±” in a quadratic equation indicates that there may be 2 solutions, we will continue solving with a “+” (t1) and then we solve with a “-” (t2), as we are looking for time and time CANNOT be negative, our time will be the positive solution
de: Das Symbol „±“ in einer quadratischen Gleichung zeigt an, dass es 2 Lösungen geben kann, wir werden mit einem „+“ (t1) lösen und dann mit a „-“ (t2) lösen, so wie wir sind Suche nach Zeit und Zeit KANN NICHT negativ sein, unsere Zeit wird die positive Lösung sein
es: El símbolo “±” en una ecuación cuadrática indica que puede haber 2 soluciones, continuaremos resolviendo con un “+” (t1) y luego resolvemos con a “-” (t2), como estamos buscando el tiempo y el tiempo NO PUEDE ser negativo, nuestro tiempo será la solución positiva
fr: Le symbole ± dans une équation quadratique indique qu'il peut y avoir 2 solutions, nous continuerons à résoudre avec un + (t1) puis nous résoudrons avec a - (t2), comme nous sommes chercher du temps et du temps NE PEUT PAS être négatif, notre temps sera la solution positive
hi: द्विघात समीकरण में प्रतीक ± इंगित करता है कि 2 समाधान हो सकते हैं, हम को + (t1) के साथ हल करना जारी रखेंगे और फिर हम a - (t2) के साथ हल करते हैं, जैसा कि हम हैं समय और समय की तलाश में नकारात्मक नहीं हो सकता, हमारा समय सकारात्मक समाधान होगा
it: Il simbolo “±” in un'equazione quadratica indica che possono esserci 2 soluzioni, continueremo risolvendo con un “+” (t1) e poi risolviamo con a “-” (t2), poiché siamo cercando il tempo e il tempo NON PUÒ essere negativo, il nostro tempo sarà la soluzione positiva
ja: 二次方程式の記号「±」は、 2 つの解が存在する可能性があることを示します。 「+」（t1）で解き続け、次に 「-」（t2）で解きます。時間と時間を探す 負のことはできません。私たちの時間は正の解決策になります
pt: O símbolo “±” em uma equação quadrática indica que pode haver 2 soluções, continuaremos resolvendo com um “+” (t1) e depois resolvemos com a “-” (t2), pois estamos procurando tempo e tempo NÃO PODE ser negativo, nosso tempo será a solução positiva
ru: Символ «±» в квадратном уравнении указывает, что может быть 2 решения, мы продолжим решение с помощью «+» (t1), а затем решим с помощью a «-» (t2), поскольку мы поиск времени и времени НЕ МОЖЕТ быть отрицательным, наше время будет положительным решением
zh: 二次方程中的符号“±”表示 可能有2个解，我们将继续 用“+”（t1）求解，然后用 a“-”（t2）求解，因为我们是寻找时间和时间 不能为负，我们的时间将是正解

# twoSolutions
source: This problem has two solutions
de: Dieses Problem hat zwei Lösungen
es: Este problema tiene dos soluciones.
fr: Ce problème a deux solutions
hi: इस समस्या के दो समाधान हैं
it: Questo problema ha due soluzioni
ja: この問題には2つの解決策があります
pt: Este problema tem duas soluções
ru: У этой проблемы есть два решения
zh: 这个问题有两种解决方案

# noSolutionT
source: This problem has no solution
de: Dieses Problem hat keine Lösung
es: Este problema no tiene solucion
fr: Ce problème n'a pas de solution
hi: इस समस्या का कोई समाधान नहीं है
it: Questo problema non ha soluzione
ja: この問題には解決策がありません
pt: Este problema não tem solução
ru: Эта проблема не имеет решения

# noNgativeTime
source: This exercise has no solution, there is no negative time
de: Diese Übung hat keine Lösung, es gibt keine negative Zeit
es: Este ejercicio no tiene solución, no hay tiempo negativo
fr: Cet exercice n'a pas de solution, il n'y a pas de temps négatif
hi: इस अभ्यास का कोई समाधान नहीं है, कोई नकारात्मक समय नहीं है
it: Questo esercizio non ha soluzione, non c'è tempo negativo
ja: この演習には解決策がなく、マイナスの時間はありません
pt: Este exercício não tem solução, não há tempo negativo
ru: Это упражнение не имеет решения, отрицательного времени не существует.
zh: 这个练习没有解，没有负时间

# noNgativeSpeed
source: This exercise has no solution, there is no negative speed
de: Diese Übung hat keine Lösung, es gibt keine negative Geschwindigkeit
es: Este ejercicio no tiene solución, no hay velocidad negativa
fr: Cet exercice n'a pas de solution, il n'y a pas de vitesse négative
hi: इस अभ्यास का कोई हल नहीं है, कोई ऋणात्मक वेग नहीं है
it: Questo esercizio non ha soluzione, non c'è velocità negativa
ja: この演習には解決策がなく、負の速度はありません
pt: Este exercício não tem solução, não há velocidade negativa
ru: Это упражнение не имеет решения, отрицательной скорости нет.
zh: 这个练习没有解，没有负速度

# noNgativeDistance
source: This exercise has no solution, there is no negative Distance
de: Diese Übung hat keine Lösung, es gibt keine negative Distanz
es: Este ejercicio no tiene solución, no hay distancia negativa
fr: Cet exercice n'a pas de solution, il n'y a pas de distance négative
hi: इस अभ्यास का कोई समाधान नहीं है, कोई नकारात्मक दूरी नहीं है
it: Questo esercizio non ha soluzione, non c'è Distanza negativa
ja: この演習には解決策がなく、負の距離はありません
pt: Este exercício não tem solução, não há Distância negativa
ru: Это упражнение не имеет решения, отрицательного расстояния не существует.
zh: 这个练习没有解，没有负距离

# speedAtAnyTime
source: Speed at any time or any height
de: Geschwindigkeit zu jeder Zeit und in jeder Höhe
es: Velocidad en cualquier momento o cualquier altura
fr: Vitesse à tout moment ou à toute hauteur
hi: किसी भी समय या किसी भी ऊंचाई पर गति
it: Velocità a qualsiasi ora ea qualsiasi altezza
ja: いつでも、どんな高さでもスピード
pt: Velocidade a qualquer momento ou em qualquer altura
ru: Скорость в любое время и на любой высоте
zh: 任何时间或任何高度的速度

# EveryNumberRaisedZero
source: Every number raised to zero equals one
de: Jede auf Null erhobene Zahl ist gleich Eins
es: Todo numero elevado a cero es igual a uno
fr: Chaque nombre élevé à zéro vaut un
hi: शून्य तक बढ़ाई गई प्रत्येक संख्या एक के बराबर होती है
it: Ogni numero elevato a zero è uguale a uno
ja: ゼロに上げられたすべての数は1に等しい
pt: Todo número elevado a zero é igual a um
ru: Каждое число, возведенное в ноль, равно единице
zh: 每个数字加到零等于一

# WeUseMinusToT2
source: We now use - to find the value of t2
de: Wir verwenden jetzt - um den Wert von t2 zu finden
es: Ahora usamos - para encontrar el valor de t2
fr: Nous utilisons maintenant - pour trouver la valeur de t2
hi: अब हम उपयोग करते हैं - t2 . का मान ज्ञात करने के लिए
it: Usiamo ora - per trovare il valore di t2
ja: ここで、-を使用してt2の値を見つけます
pt: Agora usamos - para encontrar o valor de t2
ru: Теперь мы используем - чтобы найти значение t2
zh: 我们现在使用 - 来找到 t2 的值

source: We use the following equation
de: Wir verwenden die folgende Gleichung
es: Usamos la siguiente ecuación
fr: On utilise l'équation suivante
hi: हम निम्नलिखित समीकरण का उपयोग करते हैं:
it: Usiamo la seguente equazione
ja: 次の式を使用します
pt: Usamos a seguinte equação
ru: Мы используем следующее уравнение
zh: 我们使用以下等式

source: Solving Exponents
de: Exponenten lösen
es: Resolución de exponentes...
fr: Résolution des exposants
hi: घातांक को हल करना
it: Risolvere gli esponenti...
ja: 指数を解く
pt: Resolvendo expoentes
ru: Решение показателей
zh: 求解指数

# initialSpeedZero
source: Sometimes the initial velocity is zero but sometimes it is not, if the statement says that a body is dropped or that a body starts from rest, then the initial velocity is zero. If it says that a body is thrown downward with x velocity, then the initial velocity is already greater than zero.
de: Manchmal ist die Anfangsgeschwindigkeit null, manchmal aber auch nicht, wenn die Aussage besagt, dass ein Körper fallen gelassen wird oder dass ein Körper aus der Ruhe startet, dann ist die Anfangsgeschwindigkeit null. Wenn es heißt, dass ein Körper mit x Geschwindigkeit nach unten geschleudert wird, dann ist die Anfangsgeschwindigkeit bereits größer als Null.
es: A veces la velocidad inicial es cero pero a veces no lo es, si el enunciado dice que un cuerpo se deja caer o que un cuerpo parte del reposo, entonces la velocidad inicial es cero. Si dice que un cuerpo es lanzado hacia abajo con x velocidad, entonces la velocidad inicial ya es mayor que cero.
fr: Parfois, la vitesse initiale est nulle mais parfois non, si l'énoncé dit qu'un corps est lâché ou qu'un corps part du repos, alors la vitesse initiale est nulle. S'il dit qu'un corps est projeté vers le bas avec une vitesse x, alors la vitesse initiale est déjà supérieure à zéro.
hi: कभी-कभी प्रारंभिक वेग शून्य होता है लेकिन कभी-कभी ऐसा नहीं होता है, यदि कथन कहता है कि एक पिंड गिरा है या कि एक पिंड आराम से शुरू होता है, तो प्रारंभिक वेग शून्य होता है। यदि यह कहता है कि एक पिंड को x वेग से नीचे की ओर फेंका जाता है, तो प्रारंभिक वेग पहले से ही शून्य से अधिक है।
it: A volte la velocità iniziale è zero ma a volte no, se l'affermazione dice che un corpo è caduto o che un corpo parte da fermo, allora la velocità iniziale è zero. Se dice che un corpo è lanciato verso il basso con velocità x, allora la velocità iniziale è già maggiore di zero.
ja: 初速度がゼロの場合もありますが、そうでない場合もあります。ステートメントに、物体が落下した、または物体が静止状態から開始したと記載されている場合、初速度はゼロです。物体がx速度で下向きに投げられると表示されている場合、初速度はすでにゼロより大きくなっています。
pt: Às vezes a velocidade inicial é zero, mas às vezes não é, se a afirmação diz que um corpo cai ou que um corpo parte do repouso, então a velocidade inicial é zero. Se diz que um corpo é lançado para baixo com velocidade x, então a velocidade inicial já é maior que zero.
ru: Иногда начальная скорость равна нулю, а иногда нет, если в утверждении говорится, что тело падает или что тело выходит из состояния покоя, то начальная скорость равна нулю. Если говорится, что тело брошено вниз со скоростью х, то начальная скорость уже больше нуля.
zh: 有时初始速度为零，但有时不是，如果语句说物体掉落或物体从静止开始，则初始速度为零。如果它说一个物体以 x 速度向下抛，那么初始速度已经大于零。
