Repository: PikeDeveloper/convi
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr, hi, it, ja, pt, ru, zh

source: Physics Calculator
de: Physik-Rechner
es: Calculadora Física
fr: Calculatrice physique
hi: भौतिकी कैलकुलेटर
it: Calcolatrice fisica
ja: 物理計算機
pt: Calculadora Física
ru: Калькулятор физики
zh: 物理计算器

source: Unit converter
de: Einheitenumwandler
es: Convertidor de unidades
fr: Convertisseur d'unité
hi: इकाई कनवर्टर
it: Convertitore di unità
ja: 単位変換器
pt: Conversor de unidades
ru: Конвертер единиц
zh: 单位换算

source: Volume Calculator
de: Volumenrechner
es: Calcular Volumen
fr: Calculateur de volumes
hi: वॉल्यूम कैलकुलेटर
it: Calcolatore di volume
ja: ボリューム計算機
pt: Calculadora de Volume
ru: Калькулятор объема
zh: 体积计算器

source: Area Calculator
de: Flächenrechner
es: Calcular Área
fr: Calculatrice de surface
hi: क्षेत्र कैलकुलेटर
it: Calcolatore di area
ja: 面積計算機
pt: Calculadora de área
ru: Калькулятор площади
zh: 面积计算器

source: Trigonometry
de: Trigonometrie
es: Trigonometría
fr: Trigonométrie
hi: त्रिकोणमिति
it: Trigonometria
ja: 三角法
pt: Trigonometria
ru: Тригонометрия
zh: 三角学

source: Others
de: Andere
es: Otros
fr: Autres
hi: अन्य
it: Altri
ja: その他
pt: Outros
ru: Другие
zh: 其他

source: Multiples and Submultiples
de: Vielfache und Teiler
es: Múltiplos y Submúltiplos
fr: Multiples et sous-multiples
hi: गुणक और उपगुणक
it: Multipli e sottomultipli
ja: 倍数と約数
pt: Múltiplos e Submúltiplos
ru: Кратные и дольные
zh: 倍数和约数

source: About us
de: Über uns
es: Acerca de
fr: À propos de nous
hi: हमारे बारे में
it: chi siamo
ja: 私たちに関しては
pt: Sobre nós
ru: О нас
zh: 关于我们

source: Setting
de: Einstellungen
es: Ajuste
fr: Réglages
hi: समायोजन
it: impostazioni
ja: 設定
pt: Configurações
ru: Настройки
zh: 设置

# target
source: Physical calculator is a project that aims to make a mobile application platform, website and community of students and teachers where we help each other without the students having to pay
de: Physical Calculator ist ein Projekt, das darauf abzielt, eine Plattform für mobile Anwendungen, eine Website und eine Gemeinschaft von Schülern und Lehrern zu schaffen, in der wir uns gegenseitig helfen, ohne dass die Schüler bezahlen müssen
es: Calculadora física es un proyecto que tiene como objetivo hacer una plataforma de aplicación móvil, sitio web y comunidad de estudiantes y profesores donde nos ayudamos entre todos sin que los estudiantes tengan que pagar.
fr: La calculatrice physique est un projet qui vise à créer une plate-forme d'application mobile, un site Web et une communauté d'étudiants et d'enseignants où nous nous aidons sans que les étudiants aient à payer
hi: भौतिक कैलकुलेटर एक ऐसी परियोजना है जिसका उद्देश्य छात्रों और शिक्षकों का एक मोबाइल एप्लिकेशन प्लेटफॉर्म, वेबसाइट और समुदाय बनाना है जहां हम छात्रों को भुगतान किए बिना एक-दूसरे की मदद करते हैं।
it: Il calcolatore fisico è un progetto che mira a creare una piattaforma di applicazione mobile, un sito Web e una comunità di studenti e insegnanti in cui ci aiutiamo a vicenda senza che gli studenti debbano pagare
ja: 物理計算機は、モバイルアプリケーションプラットフォーム、ウェブサイト、生徒と教師のコミュニティを作成することを目的としたプロジェクトであり、生徒が料金を支払うことなく互いに助け合うことができます。
pt: Calculadora física é um projeto que visa fazer uma plataforma de aplicativo móvel, site e comunidade de alunos e professores onde ajudamos uns aos outros sem que os alunos tenham que pagar
ru: Физический калькулятор — это проект, целью которого является создание платформы мобильных приложений, веб-сайта и сообщества студентов и преподавателей, где мы помогаем друг другу без необходимости платить студентам.
zh: 物理计算器是一个项目，旨在打造一个学生和教师的移动应用平台、网站和社区，在这里我们可以互相帮助，而无需学生付费

# pricing
source: A project like this has costs to pay for licenses, to maintain the domain of the website you also have to pay some money annually, one way to maintain this project without the student having to pay a penny is by getting a high number of users
de: Ein Projekt wie dieses hat Kosten für Lizenzen, um die Domain der Website zu pflegen, müssen Sie auch jährlich etwas Geld bezahlen. Eine Möglichkeit, dieses Projekt zu pflegen, ohne dass der Student einen Cent bezahlen muss, besteht darin, eine hohe Anzahl von Benutzern zu erhalten
es: Un proyecto como este tiene costos para pagar licencias, para mantener el dominio del sitio web también hay que pagar algo de dinero anualmente, una forma de mantener este proyecto sin que el alumno tenga que pagar un centavo es consiguiendo un número elevado de usuarios
fr: Un projet comme celui-ci a des coûts pour payer les licences, pour maintenir le domaine du site Web, vous devez également payer de l'argent chaque année, une façon de maintenir ce projet sans que l'étudiant ait à payer un sou est d'obtenir un nombre élevé d'utilisateurs
hi: इस तरह की एक परियोजना में लाइसेंस के लिए भुगतान करने की लागत होती है, वेबसाइट के डोमेन को बनाए रखने के लिए आपको सालाना कुछ पैसे भी देने पड़ते हैं, मुफ्त बनाए रखने के लिए यह ऐप कई उपयोगकर्ताओं को प्राप्त करने के लिए आवश्यक है
it: Un progetto come questo ha dei costi da pagare per le licenze, per mantenere il dominio del sito devi anche pagare dei soldi ogni anno, un modo per mantenere questo progetto senza che lo studente debba pagare un centesimo è ottenere un numero elevato di utenti
ja: このようなプロジェクトにはライセンスの支払いに費用がかかります。ウェブサイトのドメインを維持するには、毎年いくらかのお金を支払う必要があります。学生がペニーを支払うことなくこのプロジェクトを維持する1つの方法は、多数のユーザーを獲得することです。
pt: Um projeto como esse tem custos para pagar licenças, para manter o domínio do site você também tem que pagar algum dinheiro anualmente, uma forma de manter esse projeto sem que o aluno tenha que pagar um centavo é conseguindo um número alto de usuários
ru: Подобный проект требует затрат на оплату лицензий, чтобы поддерживать домен веб-сайта, вам также нужно ежегодно платить немного денег, один из способов поддерживать этот проект без того, чтобы студент платил ни копейки, - это получить большое количество пользователей.
zh: 像这样的项目需要支付许可证费用，要维护网站的域，您还必须每年支付一些钱，维护该项目而学生无需支付一分钱的一种方法是获得大量用户

# colaboration
source: If you would like to see this project come true, you can help us by sharing this app with your classmates, thank you.
de: Wenn Sie möchten, dass dieses Projekt verwirklicht wird, können Sie uns helfen, indem Sie diese App mit Ihren Klassenkameraden teilen. Vielen Dank.
es: Si te gustaría ver este proyecto hecho realidad, puedes ayudarnos compartiendo esta app con tus compañeros, gracias.
fr: Si vous souhaitez voir ce projet se réaliser, vous pouvez nous aider en partageant cette application avec vos camarades de classe, merci.
hi: यदि आप इस परियोजना को साकार होते देखना चाहते हैं, तो आप इस ऐप को अपने सहपाठियों के साथ साझा करके हमारी मदद कर सकते हैं, धन्यवाद।
it: Se vuoi vedere questo progetto realizzarsi, puoi aiutarci condividendo questa app con i tuoi compagni di classe, grazie.
ja: このプロジェクトの実現をご希望の場合は、このアプリをクラスメートと共有してください。ありがとうございます。
pt: Se você gostaria de ver este projeto se tornar realidade, você pode nos ajudar compartilhando este aplicativo com seus colegas, obrigado.
ru: Если вы хотите, чтобы этот проект стал реальностью, вы можете помочь нам, поделившись этим приложением со своими одноклассниками, спасибо.
zh: 如果你想看到这个项目成真，你可以通过与你的同学分享这个应用程序来帮助我们，谢谢。

# webAdrees
source: learn more by clicking here (spanish)
de: Erfahren Sie mehr, indem Sie hier klicken (Spanisch)
es: Conoce mas haciendo clic aquí
fr: en savoir plus en cliquant ici (espagnol)
hi: अधिक जानने के लिए यहां क्लिक करें (स्पेनिश)
it: scopri di più cliccando qui (spagnolo)
ja: ここをクリックして詳細をご覧ください（スペイン語）
pt: Saiba mais clicando aqui (espanhol)
ru: узнать больше, нажав здесь (испанский)
zh: 单击此处了解更多信息（西班牙语）

# iconsOnTheUpper
source: Some icons will appear on the upper right
de: Oben rechts erscheinen einige Symbole
es: Algunos iconos aparecerán en la parte superior derecha
fr: Certaines icônes apparaîtront en haut à droite
hi: कुछ आइकन ऊपर दाईं ओर दिखाई देंगे
it: Alcune icone appariranno in alto a destra
ja: 右上にいくつかのアイコンが表示されます
pt: Alguns ícones aparecerão no canto superior direito
ru: Некоторые значки появятся в правом верхнем углу.
zh: 右上角会出现一些图标

# informationIcon
source: This icon shows information and tips
de: Dieses Symbol zeigt Informationen und Tipps an
es: Este icono muestra información y consejos.
fr: Cette icône affiche des informations et des conseils
hi: यह आइकन जानकारी और सुझाव दिखाता है
it: Questa icona mostra informazioni e suggerimenti
ja: このアイコンは情報とヒントを示しています
pt: Este ícone mostra informações e dicas
ru: Этот значок показывает информацию и советы
zh: 此图标显示信息和提示

source: Wallpapers:
de: Hintergrundbilder:
es: Fondos de pantalla:
fr: Fonds d'écran:
hi: वॉलपेपर:
it: Sfondi:
ja: 壁紙：
ru: фон экрана
zh: 壁纸：

source: Decimals:
de: Dezimalstellen:
es: Decimales:
fr: Décimales:
hi: दशमलव:
it: Decimali:
ja: 小数：
pt: Decimais:
ru: Десятичные:
zh: 小数点：

source: Blue
de: Blau
es: Azul
fr: Bleu
hi: नीला
it: Blu
ja: 青い
pt: Azul
ru: Синий
zh: 蓝色

source: Gray
de: Grau
es: Gris
fr: Gris
hi: धूसर
it: Grigio
ja: グレー
pt: Cinza
ru: серый
zh: 灰色

source: Black
de: Schwarz
es: Negro
fr: Noir
hi: काला
it: Nero
ja: 黒
pt: Preto
ru: чернота
zh: 黑色的

# whoMenyDecimal
source: How many decimals do you want to use?
de: Wie viele Dezimalstellen möchten Sie verwenden?
es: ¿Cuántos decimales quieres usar?
fr: Combien de décimales voulez-vous utiliser ?
hi: आप कितने दशमलव का उपयोग करना चाहते हैं?
it: Quanti decimali vuoi usare?
ja: 小数点以下何桁使用しますか？
pt: Quantos decimais você quer usar?
ru: Сколько десятичных знаков вы хотите использовать?
zh: 你想使用多少个小数？

# whoMenyDecimalAngle
source: How many decimals do you want to use in sine, cosine, tangent and angles?
de: Wie viele Dezimalstellen möchten Sie in Sinus, Cosinus, Tangens und Winkeln verwenden?
es: ¿Cuántos decimales quieres usar en seno, coseno, tangente y ángulos?
hi: आप साइन, कोसाइन, स्पर्शरेखा और कोणों में कितने दशमलव का उपयोग करना चाहते हैं?
it: Quanti decimali vuoi usare in seno, coseno, tangente e angoli?
ja: サイン、コサイン、タンジェント、アングルで使用する小数はいくつですか？
pt: Quantos decimais você quer usar em seno, cosseno, tangente e ângulos?
ru: Сколько десятичных знаков вы хотите использовать в синусе, косинусе, тангенсе и углах?
zh: 您想在正弦、余弦、正切和角度中使用多少位小数？

# IconsClear
source: This icon shows the clearing of the variable in the equation
de: Dieses Symbol zeigt das Löschen der Variablen in der Gleichung an
es: Este icono muestra el despeje de la variable en la ecuación
fr: Cette icône montre l'effacement de la variable dans l'équation
hi: यह आइकन समीकरण में चर के समाशोधन को दर्शाता है
it: Questa icona mostra la cancellazione della variabile nell'equazione
ja: このアイコンは、方程式の変数のクリアを示しています
pt: Este ícone mostra a limpeza da variável na equação
ru: Этот значок показывает очистку переменной в уравнении
zh: 此图标显示等式中变量的清除

source: Temperature
de: Temperatur
es: Temperatura
fr: Température
hi: तापमान
it: Temperatura
ja: 温度
pt: Temperatura
ru: Температура
zh: 温度

source: Mass
de: Masse
es: Masa
fr: Masse
hi: द्रव्यमान
it: Massa
ja: 質量
pt: Massa
ru: масса
zh: 质量

source: Length
de: Länge
es: Longitud
fr: Longueur
hi: लंबाई
it: Lunghezza
ja: 長さ
pt: Comprimento
ru: Длина
zh: 长度

source: Volume
de: Volumen
es: Volumen
hi: आयतन
ja: 音量
ru: Объем
zh: 体积

source: Energy
de: Energie
es: Energía
fr: Énergie
hi: ऊर्जा
it: Energia
ja: エネルギー
pt: Energia
ru: Энергия
zh: 能源

source: Speed
de: Geschwindigkeit
es: Velocidad
fr: Vitesse
hi: स्पीड
it: Velocità
ja: スピード
pt: Velocidade
ru: Скорость
zh: 速度

source: Angle
de: Winkel
es: Ángulo
hi: कोण
it: Angolo
ja: 角度
pt: Ângulo
ru: Угол
zh: 角度

source: Time
de: Zeit
es: Tiempo
fr: Temps
hi: समय
it: tempo
ja: 時間
pt: Tempo
ru: Время
zh: 时间

source: Pressure
de: Druck
es: Presión
fr: Pression
hi: दबाव
it: Pressione
ja: プレッシャー
pt: Pressão
ru: Давление
zh: 压力为

source: Power
de: Leistung
es: Potencia
fr: Pouvoir
hi: शक्ति
it: Potenza
ja: 力
pt: Poder
ru: Сила
zh: 功率为

source: Radiation
de: Strahlung
es: Radiación
hi: विकिरण
it: Radiazione
ja: 放射線
pt: Radiação
ru: Радиация
zh: 辐射

source: Force
de: Gewalt
es: Fuerza
hi: बल
it: Forza
ja: 力
pt: Força
ru: Сила
zh: 力是

source: Fuel consumption
de: Kraftstoff- Verbrauch
es: Consumo de Combustible
fr: Consommation de carburant
hi: ईंधन खपत
it: Carburante Consumo
ja: 燃料 消費
pt: Consumo Combustível
ru: Расход топлива
zh: 燃料 消耗

source: Area
de: Fläche
es: Área
fr: Aire
hi: क्षेत्र
ja: 面
pt: Área
ru: площадь
zh: 面积

source: Sound
de: der Schall
es: Sonido
fr: Sonner
hi: ध्वनि
it: Suono
ja: 音
pt: Som
ru: Звук
zh: 声音

source: Density
de: Dichte
es: Densidad
fr: Densité
hi: घनत्व
it: Densità
ja: 密度
pt: Densidade
ru: плотность
zh: 密度

source: Enter Value
de: Wert eingeben
es: Ingrese valor
fr: Entrez la valeur
hi: मान दर्ज करें
it: Inserisci valore
ja: 値を入力
pt: insira valor
ru: Введите значение
zh: 输入值

source: Conversion Factor:
de: Umrechnungsfaktor:
es: Factor de conversión:
fr: Facteur de conversion:
hi: रूपांतरण कारक:
it: Fattore di conversione:
ja: 変換係数：
pt: Fator de conversão:
ru: Фактор общения:
zh: 转换系数：

source: Degrees (°)
de: Grad (°)
es: Grados (°)
fr: Degrés (°)
hi: डिग्री (डिग्री)
it: Gradi (°)
ja: 度（°）
pt: Graus (°)
ru: градусов (°)
zh: 度 (°)

# Radians
source: Radians (rad)
es: Radianes (rad)
hi: रेडियन
it: Radianti (rad)
ja: ラジアン（rad）
pt: Radianos (rad)
ru: Радианы
zh: 弧度 (rad)

# Gradians
source: Gradians (grad)
es: Gradianes (grad)
hi: स्नातक
ja: グラード（卒業生）
pt: Gradianos (grad)
ru: Градианы
zh: 度 (grad)

source: Cube
de: Würfel
es: Cubo
hi: घन
it: Cubo
ja: キューブ
pt: Cubo
ru: куб
zh: 立方体

source: Sphere
de: die Kugel
es: Esfera
fr: Sphère
hi: गेंद
it: Sfera
ja: 球
pt: Esfera
ru: Сфера
zh: 球面

source: Cone
de: Kegel
es: Cono
fr: Cône
hi: शंकु
it: Cono
ja: 円錐
ru: Конус
zh: 锥体

source: Cylinder
de: Zylinder
es: Cilindro
fr: Cylindre
hi: सिलेंडर
it: Cilindro
ja: シリンダー
pt: Cilindro
ru: Цилиндр
zh: 圆筒

source: Parallelepiped
es: Paralelepipedo
fr: Parallélépipède
hi: समानांतर खात
it: Parallelepipedo
ja: 平行六面体
pt: Paralelepípedo
ru: Параллелепипед
zh: 平行六面体

source: Spherical cap
de: Kugelkappe
es: Casquete esférico
fr: Bouchon sphérique
hi: गोलाकार टोपी
it: Cappuccio sferico
ja: 球冠
pt: Tampa esférica
ru: Сферическая крышка
zh: 球形盖

source: Spherical wedge
de: Kugeliger Keil
es: Cuña esférica
fr: Cale sphérique
hi: गोलाकार पच्चर
it: Cuneo sferico
ja: 球面楔形
pt: Cunha esférica
ru: Сферический клин
zh: 球面楔

# SphericalZone
source: Spherical segment
de: Kugelsegment
es: Zona esferica
fr: Segment sphérique
hi: गोलाकार क्षेत्र
it: Zona sferica
ja: 球形ゾーン
pt: Zona esférica
ru: Сферическая зона
zh: 球形段

source: Cone trunk
de: Kegelstumpf
es: Tronco de cono
fr: Tronc de cône
hi: शंकु ट्रंक
it: Tronco a cono
ja: コーントランク
pt: Tronco de cone
ru: усеченный конус
zh: 截锥

source: Regular octahedron
de: Regelmäßiges Oktaeder
es: Octaedro Regular
fr: Octaèdre régulier
hi: नियमित अष्टफलक
it: Ottaedro regolare
ja: 通常の八面体
pt: Octaedro regular
ru: Правильный октаэдр
zh: 正八面体

source: Straight prism
de: Gerades Prisma
es: Prisma recto
fr: Prisme droit
hi: सीधा प्रिज्म
it: Prisma dritto
ja: ストレートプリズム
pt: Prisma reto
ru: Прямая призма
zh: 直棱镜

source: Regular tetrahedron
de: Regelmäßiges Tetraeder
es: Tetraedro regular
fr: Tétraèdre régulier
hi: नियमित चतुष्फलक
it: Tetraedro regolare
ja: 正四面体
pt: Tetraedro regular
ru: Правильный тетраэдр
zh: 正四面体

source: Result:
de: das Ergebnis
es: Resultado:
fr: Résultat:
hi: परिणाम:
it: Risultato:
ja: 結果：
pt: Resultado:
ru: Результат:
zh: 结果：

# substitutingIntoEquation
source: Substituting the number into the equation...
de: Einsetzen der Zahl in die Gleichung...
es: Sustituyendo valores en la ecuación...
fr: Remplacer le nombre dans l'équation...
hi: संख्या को समीकरण में प्रतिस्थापित करना...
it: Sostituendo il numero nell'equazione...
ja: 方程式に数値を代入する...
pt: Substituindo os números na equação...
ru: Подставляем число в уравнение...
zh: 将数字代入等式...

# raisingPower3
source: Raising to the power 3...
de: Potenzierung 3...
es: Elevando al cubo...
fr: Nombre au cube...
hi: शक्ति 3 की ओर बढ़ रहा है ...
it: Numero al cubo...
ja: 累乗3...
pt: Elevando ao poder 3...
ru: Возведение в степень 3...
zh: 将数字提高到 3 的幂...

source: Squaring...
de: Quadrieren...
es: Sacando raíz cuadrada...
fr: Nombre au carré...
hi: चौकोर...
it: Numero quadrato...
ja: 二乗...
pt: Quadratura...
ru: решение квадратного корня
zh: 平方...

source: Adding...
de: Hinzufügen...
fr: Ajouter...
hi: जोड़ा जा रहा है...
it: Sommando...
ja: 追加する...
pt: Adicionando...
ru: Добавление...
zh: 解决数字的总和...

source: Subtracting...
de: Subtrahieren...
fr: Soustraire...
hi: घटाना...
it: Sottraendo...
ja: 減算...
pt: Subtração...
ru: вычитание...
zh: 解决数字减法...

source: Multiplying...
de: Multiplizieren...
es: Multiplicando...
fr: multiplier...
hi: गुणा किया जा रहा है...
it: Moltiplicando...
ja: 掛け算...
pt: Multiplicando...
ru: Умножение...
zh: 解决乘法数...

source: Dividing...
de: Teilen...
es: Sumando...
fr: diviser...
hi: विभाजित करना...
it: Dividendo...
ja: 分割...
pt: Dividindo...
ru: Разделение...
zh: 解决数除法...

# convertingToDegree
source: This equation only accepts angle in degrees, we are going to convert the angle to degrees
de: Diese Gleichung akzeptiert nur Winkel in Grad, wir werden den Winkel in Grad umwandeln
es: Esta ecuación solo acepta ángulo en grados, vamos a convertir el ángulo a grados
fr: Cette équation n'accepte que l'angle en degrés, nous allons convertir l'angle en degrés
hi: यह समीकरण कोण को केवल अंशों में स्वीकार करता है, हम कोण को अंश में बदलने जा रहे हैं
it: Questa equazione accetta solo l'angolo in gradi, convertiremo l'angolo in gradi
ja: この方程式は度単位の角度のみを受け入れます。 角度を度に変換します
pt: Esta equação só aceita ângulo em graus, vamos converter o ângulo em graus
ru: Это уравнение принимает только угол в градусах, мы собираемся преобразовать угол в градусы
zh: 这个等式只接受以度为单位的角度， 我们将把角度转换为度

# converting
source: We convert the data to the same unit (meters) to be able to add them, subtract them and everything else, it can be any unit, but we are going to use meters.
de: Wir wandeln die Daten in die gleiche Einheit (Meter) um, um sie addieren, subtrahieren und alles andere zu können, es kann jede Einheit sein, aber wir werden Meter verwenden.
es: Convertimos los datos a la misma unidad (metros) para poder sumarlos, restarlos y todo lo demás, puede ser cualquier unidad, pero vamos a usar metros.
fr: Nous convertissons les données dans la même unité (mètres) pour pouvoir ensuite les ajouter, les soustraire et tout le reste, cela peut être n'importe quelle unité, mais nous allons utiliser des mètres.
hi: हम डेटा को एक ही इकाई (मीटर) में बदल देते हैं ताकि उन्हें जोड़ सकें, उन्हें घटा सकें और बाकी सब कुछ, यह कोई भी इकाई हो सकती है, लेकिन हम मीटर का उपयोग करने जा रहे हैं।
it: Convertiamo i dati nella stessa unità (metri) per essere in grado di aggiungerli, sottrarli e tutto il resto, può essere qualsiasi unità, ma useremo i metri.
ja: データを同じ単位（メートル）に変換して、 加算、減算、その他すべてを実行できるようにします。 任意の単位にすることができますが、メートルを使用します。
pt: Convertemos os dados para a mesma unidade (metros) para poder somar, subtrair e tudo mais, pode ser qualquer unidade, mas vamos usar metros.
ru: Мы преобразуем данные в одну и ту же единицу (метры), чтобы иметь возможность складывать их, вычитать и все остальное, это может быть любая единица измерения, но мы собираемся использовать метры.
zh: 我们将数据转换为相同的单位（米），以便 能够添加、减去它们以及其他所有单位， 它可以是任何单位，但我们将使用米。

source: Square
de: Platz
es: Cuadrado
fr: Carré
hi: वर्ग
it: quadrato
ja: 平方
pt: Quadrada
ru: Квадратный
zh: 正方形

source: Circle
de: Kreis
es: Círculo
fr: Cercle
hi: वृत्त
it: Circolo
ja: 円形
pt: Círculo
ru: Круг
zh: 圆圈

source: Triangle
de: Dreieck
es: Triángulo
hi: त्रिकोण
it: Triangolo
ja: 三角形
pt: Triângulo
ru: Треугольник
zh: 三角形

source: Rectangle
de: Rechteck
es: Rectángulo
hi: आयत
it: Rettangolo
ja: 矩形
pt: Retângulo
ru: Прямоугольник
zh: 长方形

source: Rhomboid
es: Romboide
fr: Rhomboïde
hi: तिर्यग्वर्ग
it: Romboidale
ja: 菱形
pt: Rombóide
ru: ромбоид
zh: 菱形

source: Diamond
de: Diamant
es: Diamante
fr: Diamant
hi: हीरा
it: Diamante
ja: ダイヤモンド
pt: Diamante
ru: Алмаз
zh: 钻石

source: Trapeze
de: Trapez
es: Trapecio
fr: Trapèze
hi: ट्रापेज़
it: Trapezio
ja: 空中ブランコ
pt: Trapézio
ru: Трапеция
zh: 等腰梯形

source: Pythagoras
es: Pitágoras
hi: पाइथागोरस
it: Pitagora
ja: ピタゴラス
pt: Pitágoras
ru: Пифагор
zh: 毕达哥拉斯

source: Identities
de: Identitäten
es: Identidades
fr: Identités
hi: सर्वसमिका
it: Identità
ja: アイデンティティ
pt: Identidades
ru: Тождества
zh: 恒等三角

source: Cosine theorem
de: Kosinussatz
es: Teorema de coseno
fr: Théorème du cosinus
hi: कोसाइन प्रमेय
it: Teorema del coseno
ja: 余弦定理
pt: Teorema do cosseno
ru: Теорема косинусов
zh: 余弦定理

source: Sine theorem
de: Sinussatz
es: Teorema de seno
fr: Théorème des sinus
hi: ज्या प्रमेय
it: Teorema seno
ja: サイン定理
pt: Teorema do seno
ru: Теорема синусов
zh: 正弦定理

source: Tables
de: Tabellen
es: Tablas
fr: les tables
hi: टेबल
it: Tabelle
ja: テーブル
pt: Tabelas
ru: Таблицы
zh: 表

source: Choose an equation
de: Wähle eine Gleichung
es: Escoge una ecuación
fr: Choisissez une équation
hi: एक समीकरण चुनें
it: Scegli un'equazione
ja: 方程式を選択してください
pt: Escolha uma equação
ru: Выберите уравнение
zh: 选择一个方程

source: Solving the square root...
de: Quadratwurzel lösen...
es: resolviendo raíz cuadrada ...
fr: Résolution de la racine carrée...
hi: वर्गमूल को हल करना...
it: Risolvere la radice quadrata...
ja: 平方根を解く...
pt: Resolvendo a raiz quadrada...
ru: Извлечение квадратного корня...
zh: 求解平方根...

source: b cannot be greater than c
de: b kann nicht größer als c sein
es: b no pude ser más grande que c
fr: b ne peut pas être supérieur à c
hi: b से बड़ा नहीं हो सकता c
it: b non può essere maggiore di c
ja: b を超えることはできません c
pt: b não pode ser maior que c
ru: b не может быть больше, чем c
zh: b 不能大于 c

source: a cannot be greater than c
de: a kann nicht größer als c sein
es: a no pude ser más grande que c
fr: a ne peut pas être supérieur à c
hi: a से बड़ा नहीं हो सकता c
it: a non può essere maggiore di c
ja: a を超えることはできません c
pt: a não pode ser maior que c
ru: a не может быть больше, чем c
zh: a 不能大于 c

source: Fundamental
de: Grundgleichung
fr: Fondamental
hi: मौलिक
it: Fondamentale
ja: 本格的な
ru: Фундаментальный
zh: 基本方程

source: Derivatives from the fundamental
de: Ableitungen vom Fundamentalen
es: Derivadas de la fundamental
fr: Dérivés du fondamental
hi: मूल से व्युत्पन्न
it: Derivati ​​dal fondamentale
ja: 基本からの派生物
pt: Derivados do fundamental
ru: Производные от основного
zh: 从基本面衍生

source: Sum of angles
de: Winkelsumme
es: Suma de angulos
fr: Somme des angles
hi: कोण का योग
it: Somma degli angoli
ja: 角度の追加
pt: Soma de ângulos
ru: Сумма углов
zh: 角度之和

source: Angle subtraction
de: Winkelsubtraktion
es: Resta de angulos
fr: Soustraction d'angle
hi: कोण घटाव
it: Sottrazione angolare
ja: 角度減算
pt: Subtração de ângulo
ru: Вычитание угла
zh: 角度减法

source: Double angle
de: Doppelwinkel
es: Ángulo doble
fr: Angle double
hi: दोहरा कोण
it: Doppio angolo
ja: ダブルアングル
pt: Ângulo duplo
ru: Двойной угол
zh: 两个角度

source: Half angle
de: Halber Winkel
es: Medio ángulo
fr: Demi-angle
hi: आधा कोण
it: Mezzo angolo
ja: ハーフアングル
pt: Meio ângulo
ru: Полуугол
zh: 半角

source: Convert addition to multiplication
de: Addition in Multiplikation umwandeln
es: Convertir sumas en multiplicación
fr: Convertir l'addition en multiplication
hi: जोड़ को गुणा में बदलें
it: Converti addizione in moltiplicazione
ja: 加算を乗算に変換する
pt: Converter adição em multiplicação
ru: Преобразовать сложение в умножение
zh: 将加法转换为乘法

source: Convert multiplication to addition
de: Multiplikation in Addition umwandeln
es: Convertir multiplicaciones sumas
fr: Convertir la multiplication en addition
hi: गुणन को जोड़ में बदलें
it: Converti la moltiplicazione in addizione
ja: 乗算を加算に変換する
pt: Converter multiplicação em adição
ru: Преобразовать умножение в сложение
zh: 将乘法转换为加法

source: Other equivalences
de: Andere Äquivalenzen
es: Otras equivalencias
fr: Autres équivalences
it: Altre equivalenze
ja: その他の同等物
ru: Другие эквивалентности
zh: 其他等价物

source: Unknown:
de: Unbekannt:
es: Incógnita:
fr: Inconnue:
hi: अनजान:
it: Incognito:
ja: 不詳:
pt: Desconhecido:
ru: неизвестный
zh: 未知:
