Repository: PikeDeveloper/convi
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr, hi, it, ja, pt, ru, zh

source: Solving the sines...
de: Sinus lösen...
es: Resolviendo los seno...
fr: Résolution des sinus...
hi: ज्या का समाधान...
it: Risolvere i seni...
ja: 正弦を解く...
pt: Resolvendo os senos...
ru: Решение синусов...
zh: 解决正弦波...

source: Solving the cosecant...
de: Kosekans lösen...
es: Resolviendo cosecante...
fr: Résolution de la cosécante...
hi: कोसेकेंट को हल करना...
it: Risolvere la cosecante...
ja: 余割を解く...
pt: Resolvendo a cossecante...
ru: Решение косеканса...
zh: 求解余割...

source: Solving the cosines...
de: Kosinus lösen...
es: Resolviendo los coseno...
fr: Résolution des cosinus...
hi: कोसाइन को हल करना...
it: Risolvere i coseni...
ja: 余弦定解く...
pt: Resolvendo os cossenos...
ru: Решение косинусов...
zh: 解余弦...

source: Solving the secant...
de: Lösen der Sekante...
es: Resolviendo secante...
fr: Résolution de la sécante...
it: Risolvere la secante...
ja: 割線を解く...
pt: Resolvendo a secante...
ru: Решение секанса...
zh: 解决割线...

source: Solving addition and subtraction...
de: Addition und Subtraktion lösen...
es: Resolviendo suma y resta...
fr: Résolution d'addition et de soustraction...
hi: जोड़ और घटाव को हल करना...
it: Risolvere addizioni e sottrazioni...
ja: 足し算と引き算を解く...
pt: Resolvendo adição e subtração...
ru: Решение сложения и вычитания...
zh: 解决加法和减法...

# twoResultsCuadratic
source: The symbol ± in a quadratic equation indicates that there can be up to 2 solutions, we will continue solving with + (x_1), and then we solve with - (x_2)
de: Das Symbol ± in einer quadratischen Gleichung zeigt an, dass es bis zu 2 Lösungen geben kann, wir fahren mit dem Lösen mit + (x_1) fort und lösen dann mit - (x_2)
es: El símbolo ± en una ecuación cuadrática indica que puede haber hasta 2 soluciones, seguiremos resolviendo con + (x_1), y luego resolvemos con - (x_2)
fr: Le symbole ± dans une équation quadratique indique qu'il peut y avoir jusqu'à 2 solutions, nous continuerons à résoudre avec + (x_1), puis nous résoudrons avec - (x_2)
hi: द्विघात समीकरण में प्रतीक ± इंगित करता है कि 2 समाधान तक हो सकते हैं, हम + (x_1) के साथ हल करना जारी रखेंगे, और फिर हम - (x_2) के साथ हल करेंगे
it: Il simbolo ± in un'equazione quadratica indica che possono esserci fino a 2 soluzioni, continueremo a risolvere con + (x_1), quindi risolviamo con - (x_2)
ja: 二次方程式の記号±は、 最大2つの解が存在する可能性があることを示し、 +（x_1）で解き続け、次に-（x_2）で解きます
pt: O símbolo ± em uma equação quadrática indica que pode haver até 2 soluções, continuaremos resolvendo com + (x_1) e depois resolvemos com - (x_2)
ru: Символ ± в квадратном уравнении указывает, что может быть до 2 решений, мы продолжим решение с + (x_1), а затем решим с - (x_2)
zh: 二次方程中的符号 ± 表示 最多可以有 2 个解，我们将用 + (x_1) 继续 求解，然后用 - (x_2) 求解

# usingMinusSymbol
source: We now use minus (-) to find the value of x2
de: Wir verwenden jetzt Minus (-), um den Wert von x2 zu finden
es: Ahora usamos menos (-) para encontrar el valor de x2
fr: Nous utilisons maintenant moins (-) pour trouver la valeur de x2
hi: अब हम x2 . का मान ज्ञात करने के लिए ऋण (-) का उपयोग करते हैं
it: Usiamo ora meno (-) per trovare il valore di x2
ja: ここで、マイナス（-）を使用してx2の値を見つけます
pt: Agora usamos menos (-) para encontrar o valor de x2
ru: Теперь мы используем минус (-), чтобы найти значение x2
zh: 我们现在使用减号 (-) 来查找 x2 的值

# usingPlusSymbol
source: We now use plus (+) to find the value of x1
de: Wir verwenden jetzt Plus (+), um den Wert von x1 zu finden
es: Ahora usamos más (+) para encontrar el valor de x1
fr: Nous utilisons maintenant plus (+) pour trouver la valeur de x1
hi: अब हम x1 . का मान ज्ञात करने के लिए धन (+) का प्रयोग करते हैं
it: Usiamo ora più (+) per trovare il valore di x1
ja: ここで、プラス（+）を使用してx1の値を見つけます
pt: Agora usamos mais (+) para encontrar o valor de x1
ru: Теперь мы используем плюс (+), чтобы найти значение x1
zh: 我们现在使用加号 (+) 来查找 x1 的值

# noSolution
source: The negative value of the subradical quantity (what is inside the root) tells us that this problem has no solution
de: Der negative Wert der subradikalen Größe (was sich innerhalb der Wurzel befindet) sagt uns, dass dieses Problem keine Lösung hat
es: El valor negativo de la cantidad subradical (lo que está dentro de la raíz) nos dice que este problema no tiene solución
fr: La valeur négative de la quantité sous-radicale (ce qui est à l'intérieur de la racine) nous indique que ce problème n'a pas de solution
hi: सबरेडिकल मात्रा का ऋणात्मक मान (मूल के अंदर क्या है) हमें बताता है कि इस समस्या का कोई हल नहीं है
it: Il valore negativo della quantità subradicale (cosa c'è all'interno della radice) ci dice che questo problema non ha soluzione
ja: サブラジカル量の負の値 （ルートの内側にあるもの）は、この 問題には解決策がないことを示しています
pt: O valor negativo da quantidade subradical (o que está dentro da raiz) nos diz que este problema não tem solução
ru: Отрицательное значение подкоренной величины (то, что находится внутри корня) говорит нам о том, что эта проблема не имеет решения
zh: 子量 的负值（根里面是什么）告诉我们这个 问题没有解决方案

source: Second degree
de: Zweiten Grades
es: Segundo grado
fr: Second degré
hi: दूसरी उपाधि
it: Secondo grado
ja: 二度
pt: Segundo grau
ru: второй степени
zh: 二次方程

source: X1 = No solution
de: X1 = Keine Lösung
es: X1 = Sin solución
fr: X1 = Pas de solution
hi: X1 = कोई हल नहीं
it: X1 = Nessuna soluzione
ja: X1 =解決策なし
pt: X1 = Sem solução
ru: X1 = Нет решения
zh: X1 = 无解

source: X2 = No solution
de: X2 = Keine Lösung
es: X2 = Sin solución
fr: X2 = Pas de solution
hi: X2 = कोई हल नहीं
it: X2 = Nessuna soluzione
ja: X2 =解決策なし
pt: X2 = Sem solução
ru: X2 = Нет решения
zh: X2 = 无解

# periodicTable
source: Periodic table (spanish)
de: Periodensystem (Spanisch)
es: Tabla periódica
fr: Tableau périodique (espagnol)
hi: आवर्त सारणी (स्पेनिश)
it: Tavola periodica (spagnolo)
ja: 周期表 （スペイン語）
pt: Tabela periódica (espanhol)
ru: Периодическая таблица (испанский)
zh: 元素周期表 （西班牙语）

source: binomial
es: Binomio
fr: binôme
hi: द्विपद
it: Binomiale
ja: 二項
pt: binômio
ru: биномиальный
zh: 二项式

source: Algebra
es: Álgebra
fr: Algèbre
hi: बीजगणित
ja: 代数
pt: Álgebra
ru: Алгебра
zh: 代数

source: Exponent Properties
de: Exponenteneigenschaften
es: Propiedad de los exponentes
fr: Propriétés de l'exposant
hi: घातांक गुण
it: Proprietà dell'esponente
ja: 指数プロパティ
pt: Propriedades do expoente
ru: Свойства экспоненты
zh: 指数属性

source: Logarithm and exponential function
de: Logarithmus und Exponentialfunktion
es: Logaritmo y función exponencial
fr: Logarithme et fonction exponentielle
hi: लघुगणक और घातीय कार्य
it: Logaritmo e funzione esponenziale
ja: 対数と指数関数
pt: Função logarítmica e exponencial
ru: Логарифм и экспоненциальная функция
zh: 对数和指数函数

source: Product formulas
de: Produktformeln
es: Fórmulas de productos
fr: Formules de produits
hi: उत्पाद सूत्र
it: Formule di prodotto
ja: 積方程式
pt: Fórmulas de produtos
ru: Формулы продукта
zh: 产品配方

source: Factoring formulas
de: Formeln faktorisieren
es: Fórmulas de factorización
fr: Formules de factorisation
hi: फैक्टरिंग सूत्र
it: Formule di fattorizzazione
ja: 因数分解式
pt: Fórmulas de fatoração
ru: Формулы факторинга
zh: 因式分解

source: Operation with fractions
de: Betrieb mit Brüchen
es: Operación con fracciones
fr: Opération avec des fractions
hi: भिन्नों के साथ संचालन
it: Operazione con frazioni
ja: 分数での操作
pt: Operação com frações
ru: Операция с дробями
zh: 分数运算

source: Addition
de: Summe
es: Suma
fr: Une addition
hi: जोड़
it: Addizione
ja: 添加
pt: Adição
ru: Добавление
zh: 添加

source: Subtraction
de: SSubtraktion
es: Resta
fr: Soustraction
hi: घटाव
it: Sottrazione
ja: 減算
pt: Subtração
ru: вычитание

source: Multiplication
de: Multiplikation
es: Multiplicación
hi: गुणा
it: Moltiplicazione
ja: 乗算
pt: Multiplicação
ru: Умножение
zh: 乘法

source: Division
es: División
hi: प्रभाग
it: Divisione
ja: 除算
pt: Divisão
ru: разделить
zh: 分配

source: Property of inequality
de: Eigenschaft der Ungleichheit
es: Propiedad de la desigualdad
fr: Propriété de l'inégalité
hi: असमानता की संपत्ति
it: Proprietà della disuguaglianza
ja: 不等式の性質
pt: Propriedade da desigualdade
ru: Свойство неравенства
zh: 不等式性质

# doesNotChangeAdditionOrSubtraction
source: The meaning of inequality does not change if you add or subtract a number from its two members
de: Die Bedeutung der Ungleichheit ändert sich nicht, wenn Sie addieren oder eine Zahl von ihren beiden Mitgliedern subtrahieren
es: El significado de la desigualdad no cambia si sumas o restas un número de sus dos miembros
fr: La signification de l'inégalité ne change pas si vous ajoutez ou soustrayez un nombre de ses deux membres
hi: असमानता का अर्थ नहीं बदलता है यदि आप जोड़ते हैं या इसके दो सदस्यों में से एक संख्या घटाते हैं
it: Il significato di disuguaglianza non cambia se si aggiunge o si sottrae un numero ai suoi due membri
ja: を加算したり、2つのメンバーから数値を減算した りしても、不等式の意味は変わりません。
pt: O significado de desigualdade não muda se você adicionar ou subtrair um número de seus dois membros
ru: Смысл неравенства не изменится, если вы прибавите или вычтете число из двух его членов.
zh: 不等式的含义不会改变，如果你添加 或从它的​​两个成员中减去一个数字

# doesNotChangeMultiplyOrDivide
source: The meaning of inequality does not change if you multiply or divide a positive number to its two members
de: Die Bedeutung der Ungleichheit ändert sich nicht, wenn Sie multiplizieren oder eine positive Zahl durch ihre beiden Mitglieder dividieren
es: El significado de la desigualdad no cambia si multiplicas o divides un número positivo a sus dos miembros
fr: La signification de l'inégalité ne change pas si vous multipliez ou divisez un nombre positif en ses deux membres
hi: असमानता का अर्थ नहीं बदलता है यदि आप गुणा करते हैं या एक सकारात्मक संख्या को उसके दो सदस्यों से विभाजित करते हैं
it: Il significato di disuguaglianza non cambia se moltiplichi o dividi un numero positivo nei suoi due membri
ja: を乗算したり、正の数を2つのメンバーに除算したり しても、不等式の意味は変わりません。
pt: O significado de desigualdade não muda se você multiplicar ou dividir um número positivo por seus dois membros
ru: Смысл неравенства не меняется, если умножить или разделить положительное число на два его члена.
zh: 如果将 相乘或将一个正数除以它的两个成员，则不等式的含义不会改变

# ChangeMultiplyOrDivide
source: The sense of inequality is reversed if a negative number is multiplied or divided by its two members
de: Der Sinn der Ungleichheit wird umgekehrt, wenn eine negative Zahl multipliziert oder durch ihre beiden Mitglieder dividiert wird
es: El sentido de la desigualdad se invierte si un número negativo se multiplica o se divide a sus dos miembros
fr: Le sens de l'inégalité est inversé si un nombre négatif est multiplié ou divisé par ses deux membres
hi: असमानता की भावना उलट जाती है यदि एक ऋणात्मक संख्या को गुणा किया जाता है या उसके दो सदस्यों द्वारा विभाजित किया जाता है
it: Il senso di disuguaglianza viene invertito se un numero negativo viene moltiplicato o diviso per i suoi due membri
ja: 負の数にを掛けたり、その2つのメンバーで割 ったりすると、不等式の感覚が逆転します。
pt: O sentido de desigualdade é revertido se um número negativo for multiplicado ou dividido por seus dois membros
ru: Смысл неравенства меняется на противоположный, если отрицательное число умножается или делится на два его члена.
zh: 如果一个负数乘以 或除以它的两个成员，则不平等的意义是相反的

source: Exponents
de: Exponenten
es: Exponentes
fr: Exposants
hi: घातांक
it: Esponenti
ja: 指数
pt: Expoentes
ru: Экспоненты
zh: 指数

source: Transitive property
de: Transitive Eigenschaft
es: Propiedad transitiva
fr: Propriété transitive
hi: सकर्मक गुण
it: Proprietà transitiva
ja: 推移的なプロパティ
pt: Propriedade transitiva
ru: Переходное свойство
zh: 传递属性

source: Property of non-negativity
de: Eigenschaft der Nicht-Negativität
es: Propiedad de no negatividad
fr: Propriété de non-négativité
hi: गैर-नकारात्मकता की संपत्ति
it: Proprietà di non negatività
ja: 非負性の性質
pt: Propriedade da não negatividade
ru: Свойство неотрицательности
zh: 非负性

source: Reciprocal property
de: Gegenseitiges Eigentum
es: Propiedad recíproca
fr: Propriété réciproque
hi: पारस्परिक संपत्ति
ja: 相互プロパティ
pt: Propriedade recíproca
ru: Взаимное имущество
zh: 互惠性质

source: General Formula
de: Allgemeine Formel
es: Fórmula General
fr: Formule générale
hi: सामान्य सूत्र
it: Formula generale
ja: 一般式
pt: Fórmula geral
ru: Общая формула
zh: 通式

# rootsAreRealAndEqual
source: If Δ = 0 the roots are real and equal
de: Wenn Δ = 0 ist, sind die Wurzeln reell und gleich
es: Si Δ = 0 las raíces son reales e iguales
fr: Si Δ = 0 les racines sont réelles et égales
hi: यदि Δ = 0 मूल वास्तविक और बराबर हों
it: Se Δ = 0 le radici sono reali e uguali
ja: Δ= 0の場合、根は実数で等しい
pt: Se Δ = 0 as raízes são reais e iguais
ru: Если Δ = 0, то корни вещественные и равны
zh: 如果 Δ = 0，则根是实数且相等

# rootsImaginarySolution
source: If Δ < 0 the roots are not real (they have an imaginary solution)
de: Wenn Δ < 0, sind die Wurzeln nicht reell (sie haben eine imaginäre Lösung)
es: Si Δ < 0 las raíces no son reales (tienen solución imaginaria)
fr: Si Δ < 0 les racines ne sont pas réelles (elles ont une solution imaginaire)
hi: यदि Δ <0 मूल वास्तविक नहीं हैं (उनके पास एक काल्पनिक हल है)
it: Se Δ < 0 le radici non sono reali (hanno una soluzione immaginaria)
ja: Δ<0の場合、根は実数ではありません （虚数解があります）
pt: Se Δ < 0 as raízes não são reais (elas têm uma solução imaginária)
ru: Если ∆ < 0, то корни не вещественные (имеют мнимое решение)
zh: 如果 Δ < 0，根不是实数（它们有一个 imaginary 解）

# rootsAreRealAndDiferent
source: If Δ > 0 the roots are real and of different value
de: Wenn Δ > 0 ist, sind die Wurzeln reell und von unterschiedlichem Wert
es: Si Δ > 0 las raíces son reales y de diferente valor
fr: Si Δ > 0 les racines sont réelles et de valeur différente
hi: यदि Δ > 0 मूल वास्तविक हैं और भिन्न मान के हैं
it: Se Δ > 0 le radici sono reali e di valore diverso
ja: Δ> 0の場合、根は実数であり、値が異なります
pt: Se Δ > 0 as raízes são reais e de valor diferente
ru: Если ∆ > 0, то корни вещественные и разного значения.
zh: 如果 Δ > 0，则根是实数且具有不同的值

source: Logarithm property
de: Logarithmus-Eigenschaft
es: Propiedad del logaritmo
fr: Propriété logarithme
hi: लघुगणक गुण
it: Proprietà del logaritmo
ja: 対数の性質
pt: Propriedade do logaritmo
ru: Свойство логарифма
zh: 对数性质

source: Expression of logarithms
de: Ausdruck von Logarithmen
fr: Expression des logarithmes
hi: लघुगणक की अभिव्यक्ति
it: Espressione dei logaritmi
ja: 対数の表現
pt: Expressão de logaritmos
ru: Выражение логарифмов
zh: 对数的表达

source: Property of complex numbers
de: Eigenschaft komplexer Zahlen
es: Propiedad de los números complejos
fr: Propriété des nombres complexes
hi: सम्मिश्र संख्याओं की संपत्ति
it: Proprietà dei numeri complessi
ja: 複素数の性質
pt: Propriedade dos números complexos
ru: Свойство комплексных чисел
zh: 复数的性质

source: Imaginary unit property
de: Imaginäre Einheitseigenschaft
es: Propiedad de la unidad imaginaria
fr: Propriété de l'unité imaginaire
hi: काल्पनिक इकाई गुण
it: Unità immaginaria di proprietà
ja: 虚数単位のプロパティ
pt: Propriedade da unidade imaginária
ru: Свойство мнимой единицы
zh: 虚数单位属性

# SelectMovement
source: Select the type of movement
de: Wählen Sie die Bewegungsart aus
es: Seleccione el tipo de movimiento
fr: Sélectionnez le type de mouvement
hi: आंदोलन के प्रकार का चयन करें
it: Seleziona il tipo di movimento
ja: 動きの種類を選択してください
pt: Selecione o tipo de movimento
ru: Выберите тип движения
zh: 选择运动类型

source: Inclined
de: Geneigt
es: Inclinado
fr: Inclinée
hi: झुका
it: Inclinato
ja: 傾斜
pt: Inclinado
ru: Наклонный
zh: 倾斜的

source: Horizontal
hi: क्षैतिज
it: Orizzontale
ja: 水平
ru: Горизонтальный
zh: 水平的

source: Vertical
de: Vertikal
hi: लंबरूप
it: Verticale
ja: 垂直
ru: Вертикальный
zh: 垂直的

# VerticalInitialVelocity
source: Vertical component of initial velocity
de: Vertikale Komponente der Anfangsgeschwindigkeit
es: Componente vertical de la velocidad inicial
fr: Composante verticale de la vitesse initiale
hi: प्रारंभिक वेग का लंबवत घटक
it: Componente verticale della velocità iniziale
ja: 初速度の垂直成分
pt: Componente vertical da velocidade inicial
ru: Вертикальная составляющая начальной скорости
zh: 初速度的垂直分量

# horizontalInitialVelocity
source: Horizontal component of initial velocity
de: Horizontale Komponente der Anfangsgeschwindigkeit
es: Componente horizontal de la velocidad inicial
fr: Composante horizontale de la vitesse initiale
hi: प्रारंभिक वेग का क्षैतिज घटक
it: Componente orizzontale della velocità iniziale
ja: 初速度の水平成分
pt: Componente horizontal da velocidade inicial
ru: Горизонтальная составляющая начальной скорости
zh: 初速度的水平分量

# VerticalSpeed
source: Vertical speed at any time
de: Vertikale Geschwindigkeit zu jeder Zeit
es: Velocidad vertical en cualquier momento
fr: Vitesse verticale à tout moment
hi: किसी भी समय लंबवत गति
it: Velocità verticale in qualsiasi momento
ja: いつでも垂直速度
pt: Velocidade vertical a qualquer momento
ru: Вертикальная скорость в любое время
zh: 随时垂直速度

source: Time of flight
de: Flugzeit
es: Tiempo de vuelo
fr: Temps de vol
hi: उड़ान का समय
it: Tempo di volo
ja: 飛行時間
pt: Tempo de voo
ru: Время полета
zh: 飞行时间

source: Maximum height
de: Maximale Höhe
es: Altura máxima
fr: Hauteur maximale
hi: अधिकतम ऊँचाई
it: Altezza massima
ja: 最大高さ
pt: Altura máxima
ru: Максимальная высота
zh: 最大高度

source: Height at any moment
de: Höhe jederzeit
es: Altura en cualquier momento
fr: Hauteur à tout moment
hi: किसी भी क्षण ऊंचाई
it: Altezza in qualsiasi momento
ja: 高さ
pt: Altura a qualquer momento
ru: Высота в любой момент
zh: 随时的高度

source: Horizontal distance at any time
de: Horizontale Entfernung zu jeder Zeit
es: Distancia horizontal en cualquier momento
fr: Distance horizontale à tout moment
hi: किसी भी समय क्षैतिज दूरी
it: Distanza orizzontale in qualsiasi momento
ja: いつでも水平距離
pt: Distância horizontal a qualquer momento
ru: Горизонтальное расстояние в любое время
zh: 随时水平距离

source: Maximum horizontal distance
de: Maximaler horizontaler Abstand
es: Distancia horizontal máxima
fr: Distance horizontale maximale
hi: अधिकतम क्षैतिज दूरी
ja: 最大水平距離
pt: Distância horizontal máxima
ru: Максимальное горизонтальное расстояние
zh: 最大水平距离

source: Height
de: Höhe
es: Altura
fr: Hauteur
hi: कद
it: Altezza
ja: 高さ
pt: Altura
ru: Высота
zh: 身高

# convertingToTheSameUnitMRUV
source: We convert the data to a same unit, we need speed in m/s, distance in meters and time in seconds to be able to add them, subtract them and everything else
de: Wir konvertieren die Daten in dieselbe Einheit, wir brauchen Geschwindigkeit in m/s, Entfernung in Metern und Zeit in Sekunden, um sie addieren, subtrahieren und alles andere zu können
es: Convertimos los datos a una misma unidad, necesitamos velocidad en m/s, distancia en metros y tiempo en segundos para poder sumarlos, restarlos y todo lo demás
fr: Nous convertissons les données dans une même unité, nous avons besoin de vitesse en m/s, distance en mètres et temps en secondes pour pouvoir les additionner, les soustraire et tout le reste
hi: हम डेटा को एक ही इकाई में परिवर्तित करते हैं, हमें मीटर में गति, मीटर में दूरी और सेकंड में समय की आवश्यकता होती है ताकि हम उन्हें जोड़ सकें, उन्हें घटा सकें और बाकी सब कुछ कर सकें
it: Convertiamo i dati in una stessa unità, abbiamo bisogno di velocità in m/s, distanza in metri e tempo in secondi per poter sommarli, sottrarli e tutto il resto
ja: データを同じ単位に変換します。データを加算、減算、その他すべてできるようにするには、速度（m / s）、距離（メートル）、時間（秒）が 必要です。
pt: Convertemos os dados para uma mesma unidade, precisamos de velocidade em m/s, distância em metros e tempo em segundos para poder so somar, subtrair e tudo mais
ru: Переводим данные в одни и те же единицы, нам нужна скорость в m/s, расстояние в метрах и время в секундах, чтобы иметь возможность их складывать, вычитать и все остальное
zh: 我们将数据转换为相同的单位，我们需要以 m/s 为单位的速度，以米为单位的 距离和以秒为单位的时间，以便能够 将它们添加、减去它们以及其他所有内容

# speedAffterFlightTime
source: The vertical speed for a time equal to or greater than the flight time will be zero because it is already on the floor
de: Die vertikale Geschwindigkeit für eine Zeit gleich oder größer der Flugzeit ist null, da sie sich bereits auf dem Boden befindet
es: La velocidad vertical para un tiempo igual o mayor que el tiempo de vuelo será cero porque ya está en el piso
fr: La vitesse verticale pendant un temps égal ou supérieur à le temps de vol sera nulle car il est déjà au sol
hi: उड़ान के समय के बराबर या उससे अधिक समय के लिए लंबवत गति शून्य होगी क्योंकि यह पहले से ही फर्श पर है
it: La velocità verticale per un tempo uguale o superiore a il tempo di volo sarà zero perché è già a terra
ja: 飛行時間後の垂直速度は すでに床にあるため、ゼロになります
pt: A velocidade vertical para um tempo igual ou maior que o tempo de voo será zero porque já está no chão
ru: Вертикальная скорость за время, равное или превышающее времени полета, будет равна нулю, поскольку он уже находится на полу.
zh: 垂直速度等于或大于 飞行时间将为零，因为它已经在地板上

# vyAtMaximiunHeight
source: Vy is zero because at this time it has reached its maximum height and is preparing for a free fall.
de: Vy ist null, da es zu diesem Zeitpunkt seine maximale Höhe erreicht hat und sich auf einen freien Fall vorbereitet.
es: Vy es cero porque en este momento ha alcanzado su altura máxima y se está preparando para una caída libre
fr: Vy est nul car à ce moment il a atteint sa hauteur maximale et se prépare à une chute libre.
hi: Vy शून्य है क्योंकि इस समय यह अपनी अधिकतम ऊंचाई पर पहुंच गया है और मुक्त रूप से गिरने की तैयारी कर रहा है
it: Vy è zero perché in questo momento ha raggiunto la sua altezza massima e si sta preparando per una caduta libera.
ja: Vy はゼロです。これは、この時点で最大の高さに達し、 自由落下の準備をしているためです。
pt: Vy é zero porque neste momento atingiu sua altura máxima e está se preparando para uma queda livre.
ru: Vy равен нулю, так как в это время он достиг максимальной высоты и готовится к свободному падению.
zh: Vy 为零，因为此时它已达到其最大 高度并准备自由落体。

# bodyAtMaximumHeight
source: The body is at its maximum height
de: Der Körper ist in seiner maximalen Höhe
es: El cuerpo está a su altura máxima.
fr: Le corps est à sa hauteur maximale
hi: शरीर अपनी अधिकतम ऊंचाई पर है
it: Il corpo è alla sua massima altezza
ja: 体は最大の高さにあります
pt: O corpo está na altura máxima
ru: Тело находится на максимальной высоте
zh: 身体处于最大高度

# speedLessThanMaximunHeight
source: We need speed for a time less than the time it takes to reach its maximum height, so we are going to calculate that speed with the following equation:
de: Wir brauchen Geschwindigkeit für eine Zeit, die kürzer ist als die Zeit, die benötigt wird, um seine maximale Höhe zu erreichen, also werden wir diese Geschwindigkeit mit der folgenden Gleichung berechnen:
es: Necesitamos velocidad a un tiempo menor que el tiempo que tarda en alcanzar su altura máxima, por lo que vamos a calcular esa velocidad con la siguiente ecuación:
fr: Nous avons besoin de vitesse pendant un temps inférieur au temps qu'il faut pour atteindre sa hauteur maximale, nous allons donc calculer cette vitesse avec l'équation suivante:
hi: हमें इसकी अधिकतम ऊंचाई तक पहुंचने में लगने वाले समय से कम समय के लिए गति की आवश्यकता होती है, इसलिए हम निम्नलिखित समीकरण के साथ उस गति की गणना करने जा रहे हैं:
it: Abbiamo bisogno di velocità per un tempo inferiore al tempo necessario per raggiungere la sua altezza massima, quindi calcoleremo quella velocità con la seguente equazione:
ja: 最大の高さに達するまでに かかる時間よりも短い時間の速度が必要なので、次の式を使用して その速度を計算します。
pt: Precisamos de velocidade por um tempo menor que o tempo que leva para atingir sua altura máxima, então vamos calcular essa velocidade com a seguinte equação:
ru: Нам нужна скорость в течение времени, меньшего, чем время, необходимое для достижения максимальной высоты, поэтому мы собираемся вычислить эту скорость с помощью следующего уравнения:
zh: 我们需要的速度小于 达到其最大高度所需的时间，因此我们将使用以下等式计算 该速度:
